package study.practice;

public class sdfasf {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

		
		
		// for (초기화; 조건; 증감	)
		//i=1; i<=10;	i++
		
//	1. 중첩반복문을 활용하여 아래와 같이 결과가 나타나도록 출력코드를 작성해주세요.
										//	i			i
//	*****		5번		j=1; j<=5; j++		5	j<=i	1	j<=6-i	5
//	****		4번		j=1; j<=4; j++		4			2			4
//	***			3번		j=1; j<=3; j++		3			3			3
//	**			2번		j=1; j<=2; j++		2			4			2
//	*			1번		j=1; j<=1; j++		1			5			1
	
//	*****		5번		j=1; j<=5; j++		1	j=i
//	****		4번		j=2; j<=5; j++		2
//	***			3번		j=3; j<=5; j++		3
//	**			2번		j=4; j<=5; j++		4
//	*			1번		j=5; j<=5; j++		5
	
	//										i
//	*****		5번		j=5; j<=1; j--		1	j>=i	
//	****		4번		j=5; j<=2; j--		2
//	***			3번		j=5; j<=3; j--		3
//	**			2번		j=5; j<=4; j--		4
//	*			1번		j=5; j<=5; j--		5
	
	//행을 나타내는 값 : 5번 반복		(1~5) (11~15)	(101~105)
	//열을 나타내는 값 (출력되는 *의 갯수): 5 4 3 2 1
	
	//
		
	}

}
